class DictClass:

    Gan=["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
    Zhi=["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

    ShX=["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]

    numCn=["零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"]

    jqmc=["冬至", "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分",
          "寒露", "霜降", "立冬", "小雪", "大雪"]

    ymc=["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十"]

    rmc=["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九",
         "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]

    ShishenName=["正官", "七杀", "正印", "枭神（倒食）", "比肩", "劫财", "食神", "伤官", "正财", "偏财"]

    wuxing=["金","水","木","火","土"]

    jijie=["春季","夏季","秋季","冬季","四季"]

    WuxingShengwangName=["旺", "相", "休", "囚", "死"]

    ShierchangshengName=["长生", "沐浴", "冠带", "临官（禄）", "帝旺", "病", "衰", "死", "墓", "绝", "胎", "养"]

    """"甲子,乙丑,海中金",
        "丙寅,丁卯,炉中火",
        "戊辰,己巳,大林木",
        "庚午,辛未,路旁土",
        "壬申,癸酉,剑锋金",
        "甲戌,乙亥,山头火",
        "丙子,丁丑,涧下水",
        "戊寅,己卯,城头土",
        "庚辰,辛巳,白腊金",
        "壬午,癸未,杨柳木",
        "甲申,乙酉,泉中水",
        "丙戌,丁亥,屋上土",
        "戊子,己丑,劈雳火",
        "庚寅,辛卯,松柏木",
        "壬辰,癸巳,长流水",
        "甲午,乙未,沙中金",
        "丙申,丁酉,山下火",
        "戊戌,己亥,平地木",
        "庚子,辛丑,壁上土",
        "壬寅,癸卯,金箔金",
        "甲辰,乙巳,佛灯火",
        "丙午,丁未,天河水",
        "戊申,己酉,大驿土",
        "庚戌,辛亥,插环金",
        "壬子,癸丑,桑枝木",
        "甲寅,乙卯,大溪水",
        "丙辰,丁巳,沙中土",
        "戊午,己未,天上火",
        "庚申,辛酉,石榴木",
        "壬戌,癸亥,大海水"""

    nayinwuxing=[
        "海中金", "炉中火", "大林木", "路旁土", "剑锋金", "山头火", "涧下水", "城头土", "白腊金", "杨柳木", "泉中水", "屋上土", "劈雳火", "松柏木","长流水",
        "沙中金", "山下火", "平地木", "壁上土", "金箔金", "佛灯火", "天河水", "大驿土", "插环金", "桑枝木", "大溪水", "沙中土", "天上火", "石榴木", "大海水"
        ]
